Repository: beetlejuicy/2ndFloor-ServicesApp
Catalog: src/SecondFloor.I18N/Resources.*.resx
Languages: pt

# AnuncianteController_HttpGet_Cadastro_Action_ViewBagTitle
source: Seller Registration
pt: Cadastro de Anunciante

# AnuncianteController_HttpGet_Create_Action_ViewBagTitle
source: Seller Registration
pt: Cadastro de Anunciante

# AnuncianteController_HttpGet_Delete_Action_ViewBagMessage
source: Do you want to delete the following Seller? Are you sure?
pt: Tem certeza que deseja excluir o Anunciante abaixo?

# AnuncianteController_HttpGet_Delete_Action_ViewBagTitle
source: Delete Seller
pt: Excluir Anunciante

# AnuncianteController_HttpGet_Detail_Action_ViewBagTitle
source: Seller Detail
pt: Detalhes do Anunciante

# AnuncianteController_HttpGet_Detalhes_Action_ViewBagTitle
source: Seller Detail
pt: Detalhes do Anunciante

# AnuncianteController_HttpGet_Edit_Action_ViewBagTitle
source: Edit Seller
pt: Alterar Anunciante

# AnuncianteController_HttpGet_Listar_Action_ViewBagTitle
source: Sellers List
pt: Lista de Anunciantes

# AnuncianteController_HttpGet_List_Action_ViewBagTitle
source: Sellers List
pt: Lista de Anunciantes

# AnuncianteController_HttpPost_Cadastro_Action_ViewBagTitle
source: Seller Registration
pt: Cadastro de Anunciante

# AnuncianteController_HttpPost_Cadastro_Action_ViewBagTitle_Adm
source: Sellers List
pt: Lista de Anunciantes

# AnuncianteController_HttpPost_Create_Action_ViewBagTitle
source: Seller Registration
pt: Cadastro de Anunciante

# AnuncianteController_HttpPost_Delete_Action_ViewBagTitle
source: Delete Seller
pt: Excluir Anunciante

# AnuncianteController_HttpPost_Edit_Action_ViewBagTitle
source: Edit Seller
pt: Alterar Anunciante

# AnuncianteViewModels_AttributeName_RazaoSocial
source: Company Name
pt: Razão Social

# AnuncianteViewModels_AttributeName_Responsavel
source: Contact
pt: Responsável

# EnderecoController_HttpGet_Create_Action_ViewBagTitle
source: Add Address
pt: Cadastro de Endereço

# EnderecoController_HttpGet_Delete_Action_ViewBagMessage
source: Do you want to delete the following Address? Are you sure?
pt: Tem certeza que deseja excluit o Endereço abaixo?

# EnderecoController_HttpGet_Delete_Action_ViewBagTitle
source: Delete Address
pt: Excluir Endereço

# EnderecoController_HttpGet_Edit_Action_ViewBagTitle
source: Edit Address
pt: Alterar Endereço

# EnderecoController_HttpGet_List_Action_ViewBagTitle
source: Address List
pt: Lista de Endereços

# EnderecoController_HttpPost_Create_Action_ViewBagTitle
source: Add Address
pt: Cadastro de Endereço

# EnderecoController_HttpPost_Delete_Action_ViewBagTitle
source: Delete Address
pt: Excluir Endereço

# EnderecoController_HttpPost_Edit_Action_ViewBagTitle
source: Edit Address
pt: Alterar Endereço

# EnderecoViewModels_AttributeName_Bairro
source: Village
pt: Bairro

# EnderecoViewModels_AttributeName_Cidade
source: City
pt: Cidade

# EnderecoViewModels_AttributeName_Complemento
source: Complement
pt: Complemento

# EnderecoViewModels_AttributeName_Estado
source: State
pt: Estado

# EnderecoViewModels_AttributeName_Logradouro
source: Street Address
pt: Logradouro

# EnderecoViewModels_AttributeName_Numero
source: Number
pt: Número

# HomeTitle
source: Home Page
pt: Pagina Principal

# ProdutoController_HttpGet_Create_Action_ViewBagTitle
source: Add Product
pt: Cadastro de Produto

# ProdutoController_HttpGet_Delete_Action_ViewBagMessage
source: Do you want to delete the following Product? Are you sure?
pt: Tem certeza que deseja excluit o Endereco abaixo?

# ProdutoController_HttpGet_Delete_Action_ViewBagTitle
source: Delete Product
pt: Excluir Produto

# ProdutoController_HttpGet_Edit_Action_ViewBagTitle
source: Edit Product
pt: Alterar Produto

# ProdutoController_HttpGet_List_Action_ViewBagTitle
source: Product List
pt: Lista de Produtos

# ProdutoController_HttpPost_Create_Action_ViewBagTitle
source: Add Product
pt: Cadastro de Produto

# ProdutoController_HttpPost_Delete_Action_ViewBagTitle
source: Delete Product
pt: Excluir Produto

# ProdutoController_HttpPost_Edit_Action_ViewBagTitle
source: Edit Product
pt: Alterar Produto

# ProdutoViewModels_AttributeName_Descricao
source: Description
pt: Descrição

# ProdutoViewModels_AttributeName_Fabricante
source: Manufacture
pt: Fabricante

# ProdutoViewModels_AttributeName_NomeProduto
source: Product / Services
pt: Produto /Serviço

# ProdutoViewModels_AttributeName_Referencia
source: Reference
pt: Referência

# ProdutoViewModels_AttributeName_Valor
source: Price
pt: Preço

# SelectLanguage
source: Select your language:
pt: Selecione sua linguagem:

# View_Anunciante_AnunciantePartialView_Botao_Cancelar
source: Cancel
pt: Cancelar

# View_Anunciante_AnunciantePartialView_Botao_Salvar
source: Save
pt: Salvar

# View_Anunciante_Cadastro_Botao_Salvar
source: Save
pt: Salvar

# View_Anunciante_ListaAnunciantePartialView_Botao_NovoAnunciante
source: Add Seller
pt: Novo Anunciante

# View_Endereco_EnderecoPartialView_Botao_Cancelar
source: Cancel
pt: Cancelar

# View_Endereco_EnderecoPartialView_Botao_Salvar
source: Save
pt: Salvar

# View_Endereco_ListaEnderecoPartialView_Botao_NovoEndereco
source: Add Address
pt: Novo Endereço

# View_Produto_ListaProdutoPartialView_Botao_NovoProduto
source: Add Product
pt: Novo Produto

# View_Produto_ProdutoPartialView_Botao_Cancelar
source: Cancel
pt: Cancelar

# View_Produto_ProdutoPartialView_Botao_Salvar
source: Save
pt: Salvar

# AnuncioController_HttpGet_Create_Action_ViewBagTitle
source: Add Advertising
pt: Cadastro de Anuncio

# AnuncioController_HttpGet_List_Action_ViewBagTitle
source: Advertising List
pt: Lista de Anuncios

# AnuncioController_HttpPost_Create_Action_ViewBagTitle
source: Add Advertising
pt: Cadastro de Anuncio

# AnuncioViewModel_AttributeName_DataFim
source: End Date
pt: Data Fim

# AnuncioViewModel_AttributeName_DataInicio
source: Start Date
pt: Data Inicio

# AnuncioViewModel_AttributeName_Enderecos
source: Addresses
pt: Endereços

# AnuncioViewModel_AttributeName_Ofertas
source: Offers
pt: Ofertas

# AnuncioViewModel_AttributeName_Status
source: Status
pt: Condição

# AnuncioViewModel_AttributeName_Titulo
source: Title
pt: Titulo

# View_Anunciante_Detalhes_Tab_Anuncio
source: Advertising
pt: Anuncios

# View_Anunciante_Detalhes_Tab_Endereco
source: Addresses
pt: Endereços

# View_Anunciante_Detalhes_Tab_Produto
source: Products
pt: Produtos

# View_Anuncio_AnuncioAlterarPartialView_Botao_Cancelar
source: Cancel
pt: Cancelar

# View_Anuncio_AnuncioAlterarPartialView_Botao_Salvar
source: Save
pt: Salvar

# View_Anuncio_AnuncioAlterarPartialView_Calendario_DtFim
source: en
pt: pt-BR

# View_Anuncio_AnuncioAlterarPartialView_Calendario_DtInicio
source: en
pt: pt-BR

# View_Anuncio_ListaAnuncioPartialView_Botao_Alterar
source: Edit
pt: Alterar

# View_Anuncio_ListaAnuncioPartialView_Botao_NovoAnuncio
source: Add Advertising
pt: Novo Anuncio

# View_Anuncio_ListaAnuncioPartialView_Botao_Publicar
source: Publish
pt: Publicar

# View_LayoutNav_Cadastro
source: Sign In
pt: Cadastro

# View_LayoutNav_Contato
source: Contact
pt: Contato

# View_LayoutNav_Home
source: Home
pt: Principal

# View_LayoutNav_Painel
source: Manager
pt: Administração

# View_LayoutNav_Sobre
source: About
pt: Sobre

# AnuncianteServices_AlterarAnunciante_Error
source: Errors occurred:
pt: Ocorreu um erro:

# AnuncianteServices_AlterarAnunciante_NotFound
source: Seller not found!
pt: Anunciante não encontrado!

# AnuncianteServices_AlterarAnunciante_Success
source: Seller updated successfully!
pt: Anunciante atualizado com sucesso!

# AnuncianteServices_CadastrarAnunciante_Error
source: Errors occurred:
pt: Ocorreu um erro:

# AnuncianteServices_CadastrarAnunciante_Success
source: Seller registred successfully!
pt: Anunciante cadastrado com sucesso.

# AnuncianteServices_EncontrarAnunciantePor_Error
source: Errors occurred:
pt: Ocorreu um erro:

# AnuncianteServices_EncontrarAnunciantePor_NotFound
source: Seller not found!
pt: Anunciante não encontrado!

# AnuncianteServices_EncontrarAnunciantePor_Scuccess
source: Seller Found!
pt: Anunciante encontrado!

# AnuncianteServices_EncontrarTodosAnunciantes_Error
source: Errors occurred:
pt: Ocorreu um erro:

# AnuncianteServices_EncontrarTodosAnunciantes_NotFound
source: Seller not found!
pt: Nenhum anunciante encontrado!

# AnuncianteServices_EncontrarTodosAnunciantes_Success
source: Found {0} sellers
pt: Encontrado {0} anunciantes

# EnderecoServices_AlterarEndereco_Error
source: Errors occurred:
pt: Ocorreu um erro:

# EnderecoServices_AlterarEndereco_NotFound
source: Address not found!
pt: Endereço não encontrado

# EnderecoServices_AlterarEndereco_Success
source: Address updated successfully!
pt: Endereço atualizado com sucesso!

# EnderecoServices_CadastrarEndereco_AnuncianteNotFound
source: Seller not Found
pt: Anunciante não encontrado para inclusão do novo Endereço

# EnderecoServices_CadastrarEndereco_Error
source: Errors occurred:
pt: Ocorreu um erro:

# EnderecoServices_CadastrarEndereco_EstadoNotFound
source: State not found!
pt: Estado não encontrado para inclusão do novo Endereço

# EnderecoServices_CadastrarEndereco_Success
source: Address registred successfully!
pt: Endereco cadastrado com sucesso.

# EnderecoServices_EncontrarEnderecoPor_Error
source: Errors occurred:
pt: Ocorreu um erro:

# EnderecoServices_EncontrarEnderecoPor_NotFound
source: Address not found!
pt: Endereço não encontrado!

# EnderecoServices_EncontrarEnderecoPor_Success
source: Address Found!
pt: Endereço encontrado!

# EnderecoServices_EncontratTodosEnderecos_Error
source: Errors occurred:
pt: Ocorreu um erro:

# EnderecoServices_EncontratTodosEnderecos_NotFound
source: Seller information not found!
pt: O dados do Anunciante não foram encontrados.

# EnderecoServices_EncontratTodosEnderecos_Success
source: Found {0} sellers
pt: Encontrado {0} anunciantes

# EnderecoServices_ExcluirEndereco_Error
source: Errors occurred:
pt: Ocorreu um erro:

# EnderecoServices_ExcluirEndereco_NotFound
source: Address not found!
pt: Endereço não encontrado!

# EnderecoServices_ExcluirEndereco_Success
source: Address deleted successfully!
pt: Endereço excluido com sucesso!

# Infrastructure_Model_EntityBase_GetErrorMessages
source: Errors Found:
pt: Erros encontrados:

# Model_Rules_Produto_Specification_Descricao_Long
source: Product Description must have at most (1000) characters.
pt: A descrição do produto deve conter no máximo(1000) caracteres.

# Model_Rules_Produto_Specification_Descricao_NotNull
source: Product Description must be specified
pt: A descrição do produto não foi especificada.

# Model_Rules_Produto_Specification_NomeProduto_Long
source: Product Name must have at most (150) characters.
pt: O prodtuo deve conter no máximo(150) caracteres.

# Model_Rules_Produto_Specification_NomeProduto_NotNull
source: Product Name must be specified
pt: O nome do produto não foi especificado.

# Model_Rules_Specification_Anunciante_Cnpj_Invalid
source: The CNPJis invalid.
pt: O Cnpj está invalido.

# Model_Rules_Specification_Anunciante_Cnpj_NotNull
source: The CNPJ cannot be null.
pt: O Cnpj não pode ser nulo.

# Model_Rules_Specification_Anunciante_Email_Invalid
source: The Email is invalid.
pt: O Email está invalido.

# Model_Rules_Specification_Anunciante_Email_NotNull
source: The Email cannot be null.
pt: O Email não pode ser nulo.

# Model_Rules_Specification_Anunciante_NomeResponsavel_Long
source: The Contact must have at most (250) characters.
pt: O Responsável deve possuir no maximo (250) caracteres.

# Model_Rules_Specification_Anunciante_NomeResponsavel_NotNull
source: The Contact Information cannot be null.
pt: O Responsável não pode ser nulo.

# Model_Rules_Specification_Anunciante_NomeResponsavel_Short
source: The Contact must have at least (2) characters.
pt: O Responsável deve possuir no mínimo (2) caracteres.

# Model_Rules_Specification_Anunciante_RazaoSocial_Long
source: The Company Name myst have at most (250) characters.
pt: A razão social deve possuir no maximo (250) caracteres.

# Model_Rules_Specification_Anunciante_RazaoSocial_NotNull
source: The Company Name cannot be null.
pt: A Razão Social não pode ser nula.

# Model_Rules_Specification_Anunciante_RazaoSocial_Short
source: The Company Name myst have at least (4) characters.
pt: A razão social deve possuir no mínimo (4) caracteres.

# Model_Rules_Specification_Endereco_Bairro_Long
source: The village must have at most (50) characters.
pt: O bairro deve conter no máximo (50) caracteres.

# Model_Rules_Specification_Endereco_Bairro_NotNull
source: The village must be specified.
pt: O bairro não foi especificado.

# Model_Rules_Specification_Endereco_Cep_Long
source: The ZIP must have at most (9) characters.
pt: O Cep deve conter no máximo (9) caracters.

# Model_Rules_Specification_Endereco_Cep_NotNull
source: The ZIP must be specified.
pt: O Cep não foi especificado.

# Model_Rules_Specification_Endereco_Cidade_Long
source: The city must have at most (50) characters.
pt: A cidade deve conter no máximo (50) caracteres.

# Model_Rules_Specification_Endereco_Cidade_NotNull
source: The city must be specified.
pt: A cidade não foi especificada.

# Model_Rules_Specification_Endereco_Complemento_Long
source: The street address complement must have at most (250) characters.
pt: O Complemento deve conter no máximo (15) caracteres

# Model_Rules_Specification_Endereco_Logradouro_Long
source: Street address must have at most (250) characters.
pt: O logradouro deve conter no máximo (250) caracteres.

# Model_Rules_Specification_Endereco_Logradouro_NotNull
source: Street address cannot be null.
pt: O logradouro não foi especificado.

# Model_Rules_Specification_Endereco_Numero_NotNull
source: Street address number must be declared.
pt: O número do logradouro não foi especificado.

# ProdutoServices_AlterarProduto_Error
source: Errors occurred:
pt: Ocorreu um erro:

# ProdutoServices_AlterarProduto_NotFound
source: Product not found!
pt: Produto nao encontrado!

# ProdutoServices_AlterarProduto_Success
source: Product updated successfully
pt: Produto atualizado com sucesso!

# ProdutoServices_CadastrarProduto_Anunciante_NotFound
source: Seller not found!
pt: Anunciante não encontrado

# ProdutoServices_CadastrarProduto_Error
source: Errors occurred:
pt: Ocorreu um erro:

# ProdutoServices_CadastrarProduto_Success
source: Product registred Successfully
pt: Produto cadastrado com sucesso.

# ProdutoServices_EncontrarProdutoPor_Error
source: Errors occurred:
pt: Ocorreu um erro:

# ProdutoServices_EncontrarProdutoPor_NotFound
source: Product not found!
pt: Produto nao encontrado!

# ProdutoServices_EncontrarProdutoPor_Success
source: Produt found!
pt: Produto Encontrado!

# ProdutoServices_EncontrarTodosProdutos_Error
source: Errors occurred:
pt: Ocorreu um erro:

# ProdutoServices_EncontrarTodosProdutos_NotFound
source: Seller not found!
pt: Os dados deste Anunciante não foram encontrados

# ProdutoServices_EncontrarTodosProdutos_Success
source: Found {0} Products!
pt: Encontrado {0} produtos

# ProdutoServices_ExcluirProduto_Error
source: Errors occurred:
pt: Ocorreu um erro:

# ProdutoServices_ExcluirProduto_NotFound
source: Product not found!
pt: Produto nao encontrado!

# ProdutoServices_ExcluirProduto_Success
source: Product deleted successfully!
pt: Produto excluido com sucesso!

# ConsumidorServices_AtribuirRatingPara_Error
source: Errors occurred:
pt: Ocorreu um erro:

# ConsumidorServices_AtribuirRatingPara_NotFound
source: Offer not found!
pt: Nenhuma oferta encontrada!

# ConsumidorServices_AtribuirRatingPara_Success
source: Rating assigned successfully!
pt: Rating atribuido com sucesso

# ConsumidorServices_CadastrarConsumidor_Error
source: Errors occurred:
pt: Ocorreu um erro:

# ConsumidorServices_CadastrarConsumidor_Success
source: Customer registred successfully
pt: Consumidor cadastrado com sucesso

# ConsumidorServices_EncontrarOfertaPor_Error
source: Errors occurred:
pt: Ocorreu um erro:

# ConsumidorServices_EncontrarOfertaPor_NotFound
source: Offer not found!
pt: Nenhuma oferta encontrada!

# ConsumidorServices_EncontrarOfertaPor_Success
source: Found {0} offers!
pt: Encontrado {0} ofertas!

# Model_Rules_Specification_Anunciante_Email_Long
source: The Email of seller must have at most (250) characters.
pt: O email do anunciante deve conter no máximo (250) caracteres.

# Model_Rules_Specification_Consumidor_Email_Invalid
source: The Email of Customer is invalid.
pt: O email do consumidor está inválido.

# Model_Rules_Specification_Consumidor_Email_Long
source: The Email of customer must have at most (250) characters.
pt: O email do consumidor deve conter no máximo (250) caracteres.

# Model_Rules_Specification_Consumidor_Email_NotNull
source: The Email of Customer cannot be null.
pt: O email do consumidor não foi especificado.

# Model_Rules_Specification_Consumidor_Nome_Long
source: The Name of customer must have at most (50) characters.
pt: O nome do consumidor deve conter no máximo (50) caracteres.

# Model_Rules_Specification_Consumidor_Nome_NotNull
source: The Name of customer cannot be null
pt: O nome do consumidor não foi especificado.

# Model_Rules_Specification_Consumidor_Nome_Short
source: The Name of customer must have at least (4) characters.
pt: O nome do consumidor deve possuir no mínimo (4) caracteres.

# Model_Rules_Specification_Usuario_Id_Invalid
source: Invalid User!
pt: Usuario Invalido

# Model_Rules_Specification_Usuario_Login_NotNull
source: User Login cannot be null
pt: O login de usuario não foi especificado!

# Model_Rules_Specification_Usuario_Password_NotNoll
source: User password cannot be null
pt: A senha de usuario não foi especificado!

# UsuarioServices_EncontrarUsuarioPor_Error
source: Errors occurred:
pt: Ocorreu um erro:

# UsuarioServices_EncontrarUsuarioPor_NotFound
source: User not found!
pt: Usuario não encontrado!

# UsuarioServices_EncontrarUsuarioPor_Success
source: User found!
pt: Usuario Encontrado!

# UsuarioService_CadastrarUsuario_Error
source: Errors occurred:
pt: Ocorreu um erro:

# UsuarioService_CadastrarUsuario_Success
source: User Registred successfully!
pt: Usuario cadastrado com sucesso!

# UsuarioService_GerarNovaSenha_Error
source: Errors occurred:
pt: Ocorreu um erro:

# UsuarioService_GerarNovaSenha_NotFound
source: User not found!
pt: Usuario não encontrado!

# UsuarioService_GerarNovaSenha_Success
source: New Password generated successfully!
pt: Nova senha gerada com sucesso!

# AnuncioService_EncontrarAnuncioPor_Error
source: Errors occurred:
pt: Ocorreu um erro:

# AnuncioService_EncontrarAnuncioPor_NotFound
source: Advertising not found!
pt: Anuncio não encontrado!

# AnuncioService_EncontrarAnuncioPor_Success
source: Advertising found!
pt: Anuncio encontrado!

# AnuncioService_EncontrarTodosAnuncios_Error
source: Errors occurred:
pt: Ocorreu um erro:

# AnuncioService_EncontrarTodosAnuncios_NotFound
source: Seller information not found!
pt: Os dados deste Anunciante não foram encontrados.

# AnuncioService_EncontrarTodosAnuncios_Success
source: Found {0} seller(s).
pt: Encontrado {0} anunciante(s).

# AnuncioService_AlterarAnuncio_NotFound
source: Advertising not found!
pt: Anuncio não encontrado!

# AnuncioService_AlterarAnuncio_Success
source: Advertising updated successfully!
pt: Anuncio alterado com sucesso!

# AnuncioService_CadastrarAnuncio_Error
source: Errors occurred:
pt: Ocorreu um erro:

# AnuncioService_CadastrarAnuncio_NotFound
source: Seller not found!
pt: Anunciante não encontrado!

# AnuncioService_CadastrarAnuncio_Success
source: Advertising registred successfully.
pt: Anuncio cadastrado com sucesso.

# AnuncioService_EnviarAnuncioParaPublicacao_NotFound
source: No listing found!
pt: Nenhum anuncio encontrado!

# AnuncioService_EnviarAnuncioParaPublicacao_Success
source: Advertising sent for publishing successfully
pt: Anuncio enviado para publicação com sucesso.

# AnuncioService_ExcluirAnuncio_NotFound
source: Advertising not found!
pt: Anuncio não encontrado!

# AnuncioService_ExcluirAnuncio_Success
source: Advertising deleted successfully
pt: Anuncio excluido com sucesso!

# AnuncioService_PublicarAnuncio_NotFound
source: No listing found!
pt: Nenhum anuncio encontrado!

# AnuncioService_PublicarAnuncio_Success
source: Advertising published successfully
pt: Anuncio publicado com sucesso.

# View_Layout_Cultura_Ingles
source: English
pt: Inglês

# View_Layout_Cultura_Portugues
source: Portuguese
pt: Português
